STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_mux.c
    HAL_GPIO_DeInit(DET_PORT[Det], DET_PIN[Det]);
}

/**
* @brief  Returns the selected Detect state.
* @param  Det Pin to be checked.
*   This parameter can be one of following parameters:
*     @arg DET_HPD_SOURCE
*     @arg DET_USB3_DET
* @retval The Detect GPIO pin value
*/
static MUX_DETState_TypeDef MUX_DET_GetState(DetectId_TypeDef Det)
{
  GPIO_PinState PinState;

  PinState = HAL_GPIO_ReadPin(DET_PORT[Det], DET_PIN[Det]);

  if (DET_HPD_SOURCE == Det)
  {
    /* Update Context */
    Context.HPDState = HPD_STATE_LOW;
    if (GPIO_PIN_SET == PinState)
    {
      Context.HPDState = HPD_STATE_HIGH;
    }
  }
  else
  {
    /* Update Context */
    Context.USB3DetectState = USB3_NOT_CONNECTED;
    if (GPIO_PIN_SET == PinState)
    {
      Context.USB3DetectState = USB3_CONNECTED;
    }
  }

  return (PinState == GPIO_PIN_RESET) ? DET_STATE_LOW : DET_STATE_HIGH;
}

/**
* @brief  Configures SEL GPIO.
* @param  Sel Specifies the Select Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_Init(SelectId_TypeDef Sel)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    /* Enable the GPIO_DET clock */
    SELx_GPIO_CLK_ENABLE(Sel);

    /* Configure the GPIO_MOS pin */
    GPIO_InitStruct.Pin = SEL_PIN[Sel];
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

    HAL_GPIO_Init(SEL_PORT[Sel], &GPIO_InitStruct);

    HAL_GPIO_WritePin(SEL_PORT[Sel], SEL_PIN[Sel], GPIO_PIN_RESET);
}

/**
* @brief  Reset SEL GPIO configuration.
* @param  Sel Specifies the Select Pin.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_DeInit(SelectId_TypeDef Sel)
{
    HAL_GPIO_DeInit(SEL_PORT[Sel], SEL_PIN[Sel]);
}

/**
* @brief  Turns selected Sel On.
* @param  Sel Specifies the Select Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_On(SelectId_TypeDef Sel)
{
    HAL_GPIO_WritePin(SEL_PORT[Sel], SEL_PIN[Sel], GPIO_PIN_SET);
}

/**
* @brief  Turns selected Det Off.
* @param  Sel Specifies the Select Pin to be configured.
*   This parameter can be one of following parameters:
*     @arg SEL_HPDIN
* @retval None
*/
static void MUX_SEL_Off(SelectId_TypeDef Sel)
{
    HAL_GPIO_WritePin(SEL_PORT[Sel], SEL_PIN[Sel], GPIO_PIN_RESET);
}

/**
* @brief  Set debounce timer configuration.
* @param  DebounceTime Debounce time (in us)
* @retval None
*/
static void MUX_DebounceTimerSetConfig(uint32_t DebounceTime)
{
    __HAL_TIM_RESET_HANDLE_STATE(&htim);

    htim.Init.Prescaler         = (DEBOUNCE_TIM_COUNTER_CLK_FREQ() / 1000000) -1;
    htim.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim.Init.Period            = DebounceTime - 1;
    htim.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim.Init.RepetitionCounter = 0;
    htim.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

    HAL_TIM_Base_Init(&htim);
}

/**
* @brief  Reset debounce timer configuration.
* @retval None
*/
static void MUX_DebounceTimerResetConfig(void)
{
    HAL_TIM_Base_DeInit(&htim);
}

/**
  * @brief  Period elapsed callback in non-blocking mode
  * @param  htim TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    HAL_TIM_Base_Stop_IT(htim);

    if ((Context.USB3DetectState == USB3_NOT_CONNECTED) && (DET_STATE_HIGH == MUX_DET_GetState(DET_USB3_DET)))
    {
        /* Invoke registered callback function */
        Context.pfnUSB3DetectCallback(TYPE_C_MUX_1, USB3_CONNECTED);
    }

    if ((Context.USB3DetectState == USB3_CONNECTED) && (DET_STATE_LOW == MUX_DET_GetState(DET_USB3_DET)))
    {
        /* Invoke registered callback function */
        Context.pfnUSB3DetectCallback(TYPE_C_MUX_1, USB3_NOT_CONNECTED);
    }

    if ((Context.HPDState == HPD_STATE_LOW) && (DET_STATE_HIGH == MUX_DET_GetState(DET_HPD_SOURCE)))
    {
        /* Invoke registered callback function */
        Context.pfnHPDCallbackFunc(TYPE_C_MUX_2, HPD_STATE_HIGH);
    }

    if ((Context.HPDState == HPD_STATE_HIGH) && (DET_STATE_LOW == MUX_DET_GetState(DET_HPD_SOURCE)))
    {
        /* Invoke registered callback function */
        Context.pfnHPDCallbackFunc(TYPE_C_MUX_2, HPD_STATE_LOW);
    }
}
/**
  * @}
  */


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
